package study;

public class Ex09_Interface {

    public static void main(String[] args) {

        //Ex64_Interface.java

        /*

        인터페이스, interface
        - 클래스 -> 추상클래스 -> 인터페이스 -> 열거형 -> 제너릭 :: 자료형
        - 모두 클래스
        - 추상 클래스와 유사
            - 객체 생성 불가능
            - 변수 생성 가능(참조형 형변환)
            - 추상 메서드 소유 가능
        - 추상 클래스와 차이
            - 구현 멤버를 가지지 못함
            - 일반 변수, 일반 메서드 가지지 못함 -> 구현부를 가질 수 없다.
        - 추상 메서드의 집합 -> 규칙

        일반 클래스 = 변수 + 메서드
        추상 클래스 = 변수 + 메서드 + 추상 메서드
        인터페이스 = 추상 메서드

        추상 클래스와 인터페이스 역할 -> 클래스의 부모 역할 : 상속

        */

    }

}
