package study;

/*

Java

- OOP란? 객체 지향 프로그래밍이란?
하나의 클래스를 바탕으로 서로 다른 상태의 인스턴스를 만들면서 다른 행동들을 하게 할 수 있음
= 코드의 재사용 가능(재활용성). 유지 보수에 용이함.
객체와 객체의 유기적인 상호작용을 통해 프로그램이 동작하는 것. 여기서 객체란 현실의 물체를 의미함. 사람의 사고와 가장 비슷하게 프로그래밍 가능 함.
장점 > 아파치, 스프링과 같은 자바를 지원하는 많은 오픈 소스 프로젝트가 존재해서 짧은 개발 시간 내에 안정적인 프로그램 구현 가능
단점 > 비교적 속도가 느리다는게 있지만 하드웨어 성능의 발전으로 JVM 기능의 향상으로 격차가 줄어듦
자바 가상 머신 위에서 동작하기 때문에 OS에 독립적임.

- 메모리 영역이란?
1. 메소드 영역 : static 변수, 전역 변수, class 정보들 저장.
2. stack : 지역변수, 함수(메서드)등이 할당.
3. heap : new 연산자를 통한 동적 할당 된 객체 저장. 가비지 컬렉션에 의해 관리.


*/

public class Interview {


}
